tutorials/lagrangian/porousExplicitSourceReactingParcelFoam/filter/constant/energySourceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      energySourcesProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

(
    source1
    {
        active          true;
        timeStart       0.2;
        duration        2.0;
        selectionMode   points;
        volumeMode      absolute;
        fieldData       10;
        points
        (
            (2.75 0.5 0)
        );
    }
);


// ************************************************************************* //
